import re
txt='''текст с номерами телефонов 80663325543, +30682341123, и вот так еще +3(097)2344433,
 нет это не реклама life 063 112 44 33, и не (063)123-22-11 и еще можно так 050 111-55-55 '''
#+38 066 545-53-34
#'\d digit,\s slesh \w lubaka bukva'
'+38\s\d\d\d\s\d\d\d-\d\d-\d\d'
x=re.findall('\+?\3?\0?\(?\d{3}\)?\s?\d{2,4}\s?\-?\d{2,4}\s?\-?\d{2,4}',txt)
print(x)

#August 19,2004        \w+\s\d{1,2},\s\d,\s\d{4}
# ?-0,1 . *-0,infinity, + -1,infinity

#x=re.findall('\w+\s?\d{1,2},\s?\d{4}',txt)
#print(x)